#include "../include/functio.h"
#include "../include/net.h"
#include "../include/common.h"

int welcome()//客户端欢迎界面
{
	int i  = 0;;
	printf("^===========欢迎使用咸阳汽车南站售票软件============^\n");
	printf("**************************************************\n");
	printf("**************************************************\n");
	printf("********************1.连接服务器******************\n");
	printf("********************2.退出 软 件******************\n");
	printf("**************************************************\n");
	printf("**************************************************\n");
	printf("请输入:");
	while(i < 1 || i > 2)
	{
		scanf("%d",&i);
		if(1 == i)
		{
			int socketID = initSocket();//创建socket连接服务器
			if (NET_ERR == socketID)
			{
				return -1;
			}
			printf("^====================服务器已连接==================^\n");
			i = Func(socketID);//调用功能界面		
		}
		else if(2 == i)
		{
			break;	
		}
		else
		{
			printf("输入错误，请重新输入:");
		}
	}
	return 0;
}

int Func(int socketID)//功能显示界面
{
	int i  = 0;
	char *buf = NULL;
	printf("^===========欢迎使用咸阳汽车南站售票软件============^\n");
	printf("**************************************************\n");
	printf("**************************************************\n");
	printf("********************1.查询车票********************\n");
	printf("********************2.购买车票********************\n");
	printf("********************3.退出软件********************\n");
	printf("**************************************************\n");
	printf("**************************************************\n");
	while(i < 1 || i > 3)
	{
		scanf("%d",&i);
		switch (i){
			case 1:FindTicket(socketID);break;//查询车票
			case 2:BuyTicket(socketID);break;//购买车票
			case 3:close(socketID);break;//退出软件
			default:printf("输入错误,请重新输入:");break;
			}
	}
	return i;
}

void FindTicket(int socketID)//查询车票
{
	int i = -1;
	char *buf = NULL;
	printf("^===========欢迎使用咸阳汽车南站售票软件============^\n");
	printf("**********************车票查询*********************\n");
	printf("**************************************************\n");
	printf("*************-------0. 返   回 -------************\n");
	printf("*************-------1.咸阳—泾阳-------************\n");
	printf("*************-------2.咸阳—三原-------************\n");
	printf("*************-------3.咸阳—阎良-------************\n");
	printf("*************-------4.咸阳—户县-------************\n");
	printf("*************-------5.咸阳—大荔-------************\n");
	printf("*************-------6.咸阳—洛川-------************\n");
	printf("*************-------7.咸阳—富平-------************\n");
	printf("*************-------8.咸阳—延安-------************\n");
	printf("*************-------9.咸阳—周至-------************\n");
	printf("*************-------10.咸阳—蒲城-------***********\n");
	printf("*************-------11.咸阳—高陵-------***********\n");
	printf("*************-------12.咸阳—临潼-------***********\n");
	printf("*************-------13.咸阳—渭南-------***********\n");
	printf("*************-------14.咸阳—铜川-------***********\n");
	printf("*************-------15.咸阳—汉中-------***********\n");
	printf("**************************************************\n");
	printf("**************************************************\n");
	printf("请选择目的地:");
	while(i < 0 || i > 15)
	{
		scanf("%d",&i);
		switch (i){
			case 0:	buf = "0";Func(socketID);break;
			case 1:	buf = "find 泾阳";break;
			case 2:	buf = "find 三原";break;
			case 3:	buf = "find 阎良";break;
			case 4:	buf = "find 户县";break;
			case 5:	buf = "find 大荔";break;
			case 6:	buf = "find 洛川";break;
			case 7:	buf = "find 富平";break;
			case 8:	buf = "find 延安";break;
			case 9:	buf = "find 周至";break;
			case 10:buf = "find 蒲城";break;
			case 11:buf = "find 高陵";break;
			case 12:buf = "find 临潼";break;
			case 13:buf = "find 渭南";break;
			case 14:buf = "find 铜川";break;
			case 15:buf = "find 汉中";break;
			default:printf("输入错误，请重新输入目的地:");break;
			}
	}
	AcceptServer(socketID,buf);//向服务器发送需要查询的车票
	Func(socketID);	//返回功能界面
}


void BuyTicket(int socketID)//购买车票
{
	int i = -1;
	char *buf = NULL;
	printf("^===========欢迎使用咸阳汽车南站售票软件============^\n");
	printf("**********************车票购买*********************\n");
	printf("**************************************************\n");
	printf("*************-------0. 返   回 -------************\n");
	printf("*************-------1.咸阳—泾阳-------************\n");
	printf("*************-------2.咸阳—三原-------************\n");
	printf("*************-------3.咸阳—阎良-------************\n");
	printf("*************-------4.咸阳—户县-------************\n");
	printf("*************-------5.咸阳—大荔-------************\n");
	printf("*************-------6.咸阳—洛川-------************\n");
	printf("*************-------7.咸阳—富平-------************\n");
	printf("*************-------8.咸阳—延安-------************\n");
	printf("*************-------9.咸阳—周至-------************\n");
	printf("*************-------10.咸阳—蒲城-------***********\n");
	printf("*************-------11.咸阳—高陵-------***********\n");
	printf("*************-------12.咸阳—临潼-------***********\n");
	printf("*************-------13.咸阳—渭南-------***********\n");
	printf("*************-------14.咸阳—铜川-------***********\n");
	printf("*************-------15.咸阳—汉中-------***********\n");
	printf("**************************************************\n");
	printf("**************************************************\n");
	printf("请选择目的地:");
	while(i < 0 || i > 15)
	{
		scanf("%d",&i);
		switch (i){
			case 0:	buf = "0";Func(socketID);break;
			case 1:	buf = "buy 泾阳";break;
			case 2:	buf = "buy 三原";break;
			case 3:	buf = "buy 阎良";break;
			case 4:	buf = "buy 户县";break;
			case 5:	buf = "buy 大荔";break;
			case 6:	buf = "buy 洛川";break;
			case 7:	buf = "buy 富平";break;
			case 8:	buf = "buy 延安";break;
			case 9:	buf = "buy 周至";break;
			case 10:buf = "buy 蒲城";break;
			case 11:buf = "buy 高陵";break;
			case 12:buf = "buy 临潼";break;
			case 13:buf = "buy 渭南";break;
			case 14:buf = "buy 铜川";break;
			case 15:buf = "buy 汉中";break;
			default:printf("输入错误，请重新输入目的地:");break;
			}
	}
	char buffer[100] = "";
	char name[100] = "";
	char ID_num[20] = "";
	printf("请输入您的姓名:");
	scanf("%s",name);
	printf("请输入您的身份证号:");
	scanf("%s",ID_num);
	strcat(buffer,buf);
	strcat(buffer," ");
	strcat(buffer,name);
	strcat(buffer," ");
	strcat(buffer,ID_num);
	AcceptServer(socketID,buffer);
	Func(socketID);	
}
